KeckObservatory/acsnb-motor-cypress/QuadEncoderRTOS.cydsn/Generated_Source/PSoC4/EncoderDirection.h
/*******************************************************************************
* File Name: EncoderDirection.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_EncoderDirection_H) /* CY_CONTROL_REG_EncoderDirection_H */
#define CY_CONTROL_REG_EncoderDirection_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} EncoderDirection_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    EncoderDirection_Write(uint8 control) ;
uint8   EncoderDirection_Read(void) ;

void EncoderDirection_SaveConfig(void) ;
void EncoderDirection_RestoreConfig(void) ;
void EncoderDirection_Sleep(void) ; 
void EncoderDirection_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define EncoderDirection_Control        (* (reg8 *) EncoderDirection_Sync_ctrl_reg__CONTROL_REG )
#define EncoderDirection_Control_PTR    (  (reg8 *) EncoderDirection_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_EncoderDirection_H */


/* [] END OF FILE */
